Revit 2027 API
BuiltInFailures.WallFailures.LostEditsJoinsRedoFaceBased Property
 Previous edits and /or wall joins will not be preserved on this operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LostEditsJoinsRedoFaceBased { get; }
Public Shared ReadOnly Property LostEditsJoinsRedoFaceBased As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LostEditsJoinsRedoFaceBased {
	FailureDefinitionId^ get ();
}
static member LostEditsJoinsRedoFaceBased : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace